---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.MechanicalEquipment
source: html/ac807ec8-776f-63f5-3550-a56dae7f9ac3.htm
---
# Autodesk.Revit.DB.Mechanical.MechanicalEquipment

Provides access to the Mechanical Equipment in Autodesk Revit MEP.

## Syntax (C#)
```csharp
public class MechanicalEquipment : MEPModel
```

## Remarks
The Mechanical Equipment object can only be queried in Autodesk Revit MEP.